papers/cdc15-2.html
---
comments: true
layout: page
title: Dynamic State Estimation in the Presence of Compromised Sensors Data
---
<hr />
<p>
<b>Yorie Nakahira and Yilin Mo</b>
</p>

<p>
<i>IEEE Conference on Decision and Control</i>, 2015
</p>

<p>
Link to the <a href="../../../public/papers/cdc15-2.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fcdc15-2.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-orgcd2e0a8" class="outline-2">
<h2 id="orgcd2e0a8">Abstract</h2>
<div class="outline-text-2" id="text-orgcd2e0a8">
<p>
In this article, we consider the state estimation problem of a linear time invariant system in adversarial environment. We assume that the process noise and measurement noise of the system are \(l_\infty\) functions. The adversary compromises at most \(\gamma\) sensors, the set of which is unknown to the estimation algorithm, and can change their measurements arbitrarily. We first prove that if after removing a set of \(2\gamma\) sensors, the system is undetectable, then there exists a destabilizing noise process and attacker's input to render the estimation error unbounded. For the case that the system remains detectable after removing an arbitrary set of \(2\gamma\) sensors, we construct a resilient estimator and provide an upper bound on the \(l_\infty\) norm of the estimation error. Finally, a numerical example is provided to illustrate the effectiveness of the proposed estimator design.
</p>
</div>
</div>
